Revit 2027 API
StructuralSection.WarpingConstant Property
 Warping constant (Cw, Iomega, H).
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WarpingConstant { get; set; }
Public Property WarpingConstant As Double
	Get
	Set
public:
property double WarpingConstant {
	double get ();
	void set (double value);
}
member WarpingConstant : float with get, set
Property Value
Double
See Also
Reference
StructuralSection Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace